<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default' => 'redis',

    // 缓存连接方式配置
    'stores'  => [
        'redis' => [
            // 驱动方式
            'type'   => 'Redis',
            'prefix' => env('cache.prefix', ''),
            // 缓存有效期 0表示永久缓存
            'expire' => env('cache.expire', 0),
            // 服务器地址
            'host'   => env('cache.server', '127.0.0.1'),
        ],
        // 更多的缓存连接
    ],
];
